{
	"basics": {
		"name": "Danny Gillies",
		"title": "Software Developer",
		"email": "gillies.daniel@gmail.com"
	},
	"work": [
		{
			"company": "AIReverie, Inc.",
			"position": "UE4 C++ Engineer",
			"startDate": "May 2018",
			"endDate": "Present",
			"description": "AI.Reverie is a simulation platform that trains AI to understand the world. https://aireverie.com",
			"highlights": [
				"Designed and implemented a procedural road generation system used to generate an area of 149 sq. km. of city.",
				"Created and maintained tools to speed up the development cycle for other engineers and artists"
			]
		},
		{
			"company": "Elevate Labs",
			"position": "Game Developer",
			"startDate": "September 2017",
			"endDate": "January 2018",
			"description": "Elevate is a new type of cognitive training tool designed to build communication and analytical skills.",
			"highlights": [
				"Designed and built prototypes for new exercises.",
				"Modified existing games to allow support for IPhone X.",
				"Added new instances to data warehouse content testing pipeline."
			]
		},
		{
			"company": "Piper, Inc.",
			"position": "Game Developer",
			"startDate": "October 2016",
			"endDate": "July 2017",
			"description": "Piper makes a build-it-yourself computer kit for kids using a Raspberry Pi. It runs a 3D game we made to teach kids about STEM topics with a voxel engine.",
			"highlights": [
				"Designed and Developed Music Sequencer Level to include full drum kits, octaves, and recording functionality with dynamic length and bpm.",
				"Built GUI system using PyQt to control level selection, wi-fi, language and volume settings, and in-game HUD.",
				"Created sound and video utilities for playing of audio and video.",
				"Expanded the customization of Minetest through multiple Lua scripts.",
				"Developed custom support for special Lua API calls using Irrlicht Engine and Minetest.",
				"Added pathfinding AI to ensure a programmatically generated level was beatable."
			]
		},
		{
			"company": "SKULLY",
			"position": "Software Developer/Lead Experience Engineer",
			"startDate": "July 2015",
			"endDate": "July 2016",
			"description": "Skully was a hardware company manufacturing motorcycle helmets with a heads-up display that featured a 180 degree rear-view camera and gps.",
			"highlights": [
				"Developed Three.js/WebGL VR phone experience where the SKULLY helmet was connected to the user's phone.",
				"Designed and Implemented in Unity the VR experience for iOS and Android for the Google Cardboard and Gear VR.",
				"Built and Maintained the SKULLY website using JS/HTML/CSS and Bootstrap 3.",
				"Launched NGINX server with a Docker image for testing and deployment on AWS.",
				"Designed a workflow to build minified source files, compress images/videos, build docker images, and deploy to AWS.",
				"Featured on Shopify for my implementation of their \"Add to Cart Button\"."
			]
		},
		{
			"company": "Kinetech Arts / Kineviz Studios",
			"position": "Software Engineering Intern",
			"startDate": "February 2015",
			"endDate": "June 2015",
			"description": "Kineviz is a data visualization company that uses interactive demos and art to help display data in a more meaningful way.",
			"highlights": [
				"Created a full-stack web application using Node.js, Three.js, Physi,js, and WebGL to visualize tweets and audio data in a 3D world.",
				"Developed support for Oculus Rift VR, Microsoft Kinect and Wii Balance Board.",
				"Designed and Built server architecture to allow for tweets to be pulled into the 3D scene in real-time with specific hashtags.",
				"Presented the project for Autodesk’s 3D Webfest 2015 (<a href='https://youtu.be/fiS3NBZRY44?t=1605'>Video</a>) - Project can be viewed here: <a href='http://vrdatalandscape.com/'>vrdatalandscape.com</a>."
			]
		}
	],
	"awards": [
		{
			"award": "3D Webfest Recognized Project",
			"organization": "Autodesk",
			"date": "May 2015",
			"description": "Built a <a href='http://vrdatalandscape.com/'>WebGL application</a> to visualize twitter and audio data in an artistic manner. The project was put on display at Autodesk's 3D Webfest.",
			"video": "fiS3NBZRY44?start=1605"
		},
		{
			"award": "Electronic Sports World Cup",
			"organization": "ESWC",
			"date": "October 2014",
			"description": "Qualified to represent North America in an international LAN event in Paris, France for the title of world champion.",
			"video": "ZRWWfhL9Fso?start=450"
		},
		{
			"award": "1st Place, PAX East 2014",
			"organization": "Ubisoft",
			"date": "March 2013",
			"description": "Won the PAX East open qualifier for the IGN Pro League Season 6 championships with a prize pool of $100,000.",
			"video": "MVHEjjOtAAk?start=540"
		}
	]
}
