{
	"basics": {
		"name": "Danny Gillies",
		"title": "Generalist & Tools Developer",
		"email": "gillies.daniel@gmail.com",
		"phone": "(845) 825-1645",
		"linkedin": "https://www.linkedin.com/in/danielgillies1/",
		"github": "https://github.com/DanielGillies",
		"website": "danielgillies.dev",
		"about": "Born and raised in New York, moved to the West Coast for new experiences, and then back to the East Coast. Currently living in Durham, NC. Travelled to compete in video games and now working as a UE5 Tools Engineer."
	},
	"work": [
		{
			"company": "Game Science",
			"position": "Senior Platform Engineer",
			"startDate": "September 2023",
			"endDate": "Present",
			"description": "A Prytania Media-owned organization offering technical and operational solutions to video game studios.",
			"highlights": [
				"Supported 3 other AAA studios in development of their games, allowing one of them to have mutliplayer demos running in only 6 weeks",
				"Added an authentication layer to Unreal Game Sync to allow using a publicly hosted UGS Metadata Server while still securing data.",
				"Updated the Unreal Game Sync Metadata Server to require user authentication.",
				"Managed and deployed AWS resources using Terraform to support TeamCity and UGS.",
				"Set up automated builds of the Editor and Game using TeamCity."
				
			]
		},
		{
			"company": "Treehouse Games",
			"position": "Senior Tools Engineer",
			"startDate": "January 2022",
			"endDate": "July 2023",
			"description": "Treehouse is a game studio dedicated to collaborative games that help players share memorable experiences and deepen their friendships.",
			"highlights": [
				"Setup Unreal Game Sync (UGS) for a team of over 15 engineers, artists, and designers.",
				"Implemented an automated build process for UE Editor Binaries to be distributed amongst the development and production teams using Jenkins and UE BuildGraph.",
				"Facilitated the upgrade of our internal engine version from 4.26 to 5.0",
				"Designed and created multiplayer gameplay experiences that take place across multiple game servers.",
				"Created a custom node-based graph editor for our quest system to streamline quest development and reduce the chance of mistakes while editing data assets.",
				"Developed a plan for release management and internal playtesting using perforce branching and feature toggles.",
				"Managed external contractors for audio and ensured their engineering needs were met so they could work effectively."
			]
		},
		{
			"company": "Bit Fry Game Studios, Inc.",
			"position": "Developer Operations and Engine Tooling Engineer",
			"startDate": "June 2021",
			"endDate": "November 2021 (Lay-offs)",
			"description": "Bit Fry Games Studio is an independent developer and publisher of video games, focused on their first franchise called Ultimate Rivals, a multi-sport arcade-action sports platform.",
			"highlights": [
				"Setup Unreal Game Sync (UGS) for a team of over 40 engineers, artists, and designers.",
				"Implemented an automated build process for UE4 Editor Binaries to be distributed amongst the development and marketing teams using Jenkins and UE4 BuildGraph.",
				"Re-organized perforce stream structure to allow for more efficient onboarding of new employees, and adjustments to support built-in UE4 tools and systems.",
				"Implemented a deferred download system to allow the user (on mobile) to download just initial required files, and then downloading the rest of the content on first launch, improving initial download times by about 90%."
			]
		},
		{
			"company": "AIReverie, Inc.",
			"position": "Lead Core Platform Engineer",
			"startDate": "January 2021",
			"endDate": "June 2021",
			"description": "AI.Reverie is a simulation platform that trains AI to understand the world. https://aireverie.com",
			"highlights": [
				"Architected and implemented new perforce stream solution to fit our project structure.",
				"Improved our implementation of Unreal Game Sync to better facilitate team, including setup of distributing precompiled editors for non-engineers.",
				"Managed merging and organizing content and source code across a perforce depot used by a team of 15+ developers.",
				"Created a style guide to go over best practices across the entire team and all projects, combined with adding a linter tool to UE4 to allow an easy way to check against the style guide.",
				"Directly managed a team of 4 technical artists and engineers across Houdini and UE4 in very rapid prototyping of systems and tools for synthetic data generation.",
				"Led development of synthetic data platform that resulted in an acquisition of the company."
			]
		},
		{
			"company": "AIReverie, Inc.",
			"position": "UE4 C++ Engineer",
			"startDate": "May 2018",
			"endDate": "January 2021",
			"description": "AI.Reverie is a simulation platform that trains AI to understand the world. https://aireverie.com",
			"highlights": [
				"Created DLC system in UE4 to download environments from S3 using authentication.",
				"Created login/user profile system in UE4 with associated permissions for access to specific environments and selectable pawns.",
				"Customized and set up Unreal Game Sync to allow for easy use of perforce.",
				"Created a road generation system based on open street maps data, including intersections and AI vehicles.",
				"Designed and implemented a REST api with a python scriptable front end to automate capturing images in UE4 on both remote and local machines.",
				"Packaged and distributed installable versions of our simulations to multiple clients, providing support and usage instructions. This contained a local version of the python API used to start captures.",
				"Provided general engineering support to a team of 5 technical artists and 4 Houdini artists.",
				"Upgrade internal UE4 to new versions released by Epic as necessary.",
				"Modified UE4 source code to better facilitate the needs of the development team.",
				"Created tools for technical artists to use, and taught best practices and new ways to build systems using blueprints more efficiently.",
				"Developed the core platform for generating millions of images and video frames of synthetic data very quickly, across multiple industries."
			]
		},
		{
			"company": "Elevate Labs",
			"position": "Game Developer",
			"startDate": "September 2017",
			"endDate": "January 2018",
			"description": "Elevate is a new type of cognitive training tool designed to build communication and analytical skills.",
			"highlights": [
				"Designed and built prototypes for new exercises.",
				"Modified existing games to allow support for IPhone X.",
				"Added new instances to data warehouse content testing pipeline."
			]
		},
		{
			"company": "Piper, Inc.",
			"position": "Game Developer",
			"startDate": "October 2016",
			"endDate": "July 2017",
			"description": "Piper makes a build-it-yourself computer kit for kids using a Raspberry Pi. It runs a 3D game we made to teach kids about STEM topics with a voxel engine.",
			"highlights": [
				"Designed and Developed Music Sequencer Level to include full drum kits, octaves, and recording functionality with dynamic length and bpm.",
				"Built GUI system using PyQt to control level selection, wi-fi, language and volume settings, and in-game HUD.",
				"Created sound and video utilities for playing of audio and video.",
				"Expanded the customization of Minetest through multiple Lua scripts.",
				"Developed custom support for special Lua API calls using Irrlicht Engine and Minetest.",
				"Added pathfinding AI to ensure a programmatically generated level was beatable."
			]
		},
		{
			"company": "SKULLY",
			"position": "Software Developer/Lead Experience Engineer",
			"startDate": "July 2015",
			"endDate": "July 2016",
			"description": "Skully was a hardware company manufacturing motorcycle helmets with a heads-up display that featured a 180 degree rear-view camera and gps.",
			"highlights": [
				"Developed Three.js/WebGL VR phone experience where the SKULLY helmet was connected to the user's phone.",
				"Designed and Implemented in Unity the VR experience for iOS and Android for the Google Cardboard and Gear VR.",
				"Built and Maintained the SKULLY website using JS/HTML/CSS and Bootstrap 3.",
				"Launched NGINX server with a Docker image for testing and deployment on AWS.",
				"Designed a workflow to build minified source files, compress images/videos, build docker images, and deploy to AWS.",
				"Featured on Shopify for my implementation of their \"Add to Cart Button\"."
			]
		}
	],
	"skills": [
		{
			"category": "Technologies",
			"skills": [
				"Perforce",
				"Git",
				"Unreal Game Sync",
				"Jenkins",
				"TeamCity",
				"JIRA",
				"Terraform",
				"AWS"
			]
		},
		{
			"category": "Programming Languages",
			"skills": [
				"C++",
				"Python",
				"C#",
				"Lua",
				"Javascript"
			]
		},
		{
			"category": "Gaming",
			"skills": [
				"Unreal Engine",
				"Unity",
				"Virtual Reality",
				"Playing!"
			]
		}
	],
	"awards": [
		{
			"award": "3D Webfest Recognized Project",
			"organization": "Autodesk",
			"date": "May 2015",
			"description": "Built a WebGL application to visualize twitter and audio data in an artistic manner. The project was put on display at Autodesk's 3D Webfest.",
			"video": "fiS3NBZRY44?start=1605"
		}
	],
	"education": [
		{
			"school": "University of San Francisco",
			"start": "August 2013",
			"end": "May 2015",
			"degree": "Computer Science"
		},
		{
			"school": "Marist College",
			"start": "August 2011",
			"end": "May 2013",
			"degree": "Computer Science/Game Development"
		}
	]
}
